[
	{
		"title":	"VIATRA 1.6 is out with Eclipse Oxygen", 
		"date":		"June 30, 2017", 
		"body":		"<p>The <a target=\"_blank\" href=\"http://eclipse.org/viatra\">VIATRA project</a> is happy to report that release 1.6.0, included in the <a href=\"https://www.eclipse.org/oxygen/\">Eclipse Oxygen Release Train</a>, is now available with multiple new features and fixed bugs.</p><p>The most notable highlights of this VIATRA release include:</p><ul><li><strong>Query runtime enhancements</strong> for special cases, like dangling edges and recursive patterns result in less surprises for users of the query engine.</li><li><strong>The Getting started tutorial</strong> was updated and extended from its previos version, and now is available both from <a href=\"https://www.eclipse.org/viatra/documentation/tutorial.php\">the project website</a> and <a href=\"http://help.eclipse.org/oxygen/topic/org.eclipse.viatra.documentation.help/html/tutorial/intro.html?cp=102_1\">the Eclipse Help</a> as well. The tutorial features both query and transformation development features.</li><li><strong>The Query Test facilities</strong> of VIATRA that were originally used for internal tests are now extended to use for the testing of queries as well: it is possible to evaluate the results of model queries, and calculate coverage report for them.</li></ul><p>For a more complete list of changes, see the dedicated <a target=\"_blank\" href=\"https://wiki.eclipse.org/VIATRA/Releases/NewAndNoteworthy1.6\">New and noteworthy</a> page, or have a look at the list of <a target=\"_blank\" href=\"https://projects.eclipse.org/projects/modeling.viatra/releases/1.6.0/bugs\">fixed issues</a>.</p><p>All downloads are available now from the <a href=\"/downloads.html\">downloads area</a> or the <a target=\"_blank\" href=\"http://marketplace.eclipse.org/content/viatra\">marketplace</a> and the main Oxygen update site as well.</p><p>Feel free to reach out on the Eclipse Forums of VIATRA or the developer mailing list if you have questions, we will not leave any unanswered. You can also request <a target=\"_blank\" href=\"http://incquerylabs.com/\">industrial support</a> for more advanced issues.</p>", 
		"author":	"Zoltan Ujhelyi",
		"tags":		{"0":"viatra","1":"release","2":"planeteclipse","3":"eclipse.org"},
		"done":		true 
	}


]